src/Documents/ИзменениеБаланса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИзменениеБаланса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Оборот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инвестиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Баланс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Заполняется автоматически из Кошелек.Валюта при записи, если не указана явно.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВОсновнойВалюте</Name>
					<Comment>Вычисляется автоматически при записи: Сумма, пересчитанная в Константа.ОсновнаяВалюта по курсу на дату документа.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/Оборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Оборот</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВОсновнойВалюте</Name>
					<Comment>Сумма, пересчитанная в Константа.ОсновнаяВалюта — единственный ресурс, который можно суммировать по разным кошелькам/валютам.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта суммы (совпадает с Кошелек.Валюта). Дублируется здесь для удобства запросов.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвестиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инвестиции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ИзменениеБаланса/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Оборот Приход
	Движения.Оборот.Записывать = Истина;
	Движение = Движения.Оборот.Добавить();
	Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
	Движение.Период 			= Дата;
	Движение.Кошелек 			= Кошелек;
	Движение.Цель 				= Цель;
	Движение.Инвестиция			= Инвестиция;
	Движение.Валюта				= Валюта;
	Движение.Сумма 				= Сумма;
	Движение.СуммаВОсновнойВалюте	= СуммаВОсновнойВалюте;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЗначениеЗаполнено(Валюта) И ЗначениеЗаполнено(Кошелек) Тогда
		Валюта = Кошелек.Валюта;
	КонецЕсли;

	Если Баланс <> 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Инвестиция", Инвестиция);
		Запрос.УстановитьПараметр("Кошелек", Кошелек);
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Цель", Цель);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ОборотОстатки.СуммаОстаток, 0)) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Оборот.Остатки(
		|			&Дата,
		|			Инвестиция = &Инвестиция
		|				И Кошелек = &Кошелек
		|				И Цель = &Цель) КАК ОборотОстатки";
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Сумма = Баланс - Выборка.СуммаОстаток;

	КонецЕсли;

	Если ЗначениеЗаполнено(Валюта) Тогда
		СуммаВОсновнойВалюте = ЛФПСервер.КонвертироватьВОсновнуюВалюту(Сумма, Валюта, Дата);
	Иначе
		СуммаВОсновнойВалюте = Сумма;
	КонецЕсли;

КонецПроцедуры
